lvl_select_txt = "Приветствую вас в игре угадай карту.\nВыберите \
уровень:\n1 - Угадать цвет масти.\n2 - Угадать ранг карты\
(Туз, Дама, 5, 10, итд).\n3 - Угадать карту полностью.\n4 - Выйти из игры."

lvl_annotation = '\nВведите выбранный уровень(1, 2, 3 или 4(выход из игры)): '

win_list = ["Поздравляю, так держать!", "Ура, ура! Победа!", "С победой, ура! Я тебя поздравляю!",
            "С победою от всей души"]

# card_values_figure = ["ace", "king", "queen", "jack"]
# card_values = [str(x) for x in range(2, 10)]
# card_values.extend(card_values_figure[::-1])
card_values = ['2', '3', '4', '5', '6', '7', '8', '9', 'jack', 'queen', 'king', 'ace']
card_suits = ["♥", "♦", "♣", "♠"]

# all_cards = [i + " " + x for i in card_suits for x in card_values]
all_cards = ['♥ 2', '♥ 3', '♥ 4', '♥ 5', '♥ 6', '♥ 7', '♥ 8', '♥ 9', '♥ jack', '♥ queen',
             '♥ king', '♥ ace', '♦ 2', '♦ 3', '♦ 4', '♦ 5', '♦ 6', '♦ 7', '♦ 8', '♦ 9', '♦ jack', '♦ queen', '♦ king',
             '♦ ace', '♣ 2', '♣ 3', '♣ 4', '♣ 5', '♣ 6', '♣ 7', '♣ 8', '♣ 9', '♣ jack', '♣ queen', '♣ king', '♣ ace',
             '♠ 2', '♠ 3', '♠ 4', '♠ 5', '♠ 6', '♠ 7', '♠ 8', '♠ 9', '♠ jack', '♠ queen', '♠ king', '♠ ace']

sell_suits_annotation = "\nВыберите масть(число от 1 до 4)\n♥ - 1\n♦ - 2\n♣ - 3\n♠ - 4\nВведите ваш ответ: "

dict_sell_suits_annotation = {"1": "♥", "2": "♦", "3": "♣", "4": "♠"}
